#!/bin/bash
title() {
  echo
  echo -e "\033[1;33mepm - \033[1;37mПакетный менеджер Etersoft \033[0m"
  echo -e "\033[1;32mИспользование:\033[0m epm {команда} [аргументы]"
  echo
}

tool_help() {
  ##########################
  # epm tool
  ##########################
  echo -e "\033[1;36m[ Встроенные инструменты epm (epm tool) ]\033[0m"
  echo
  echo -e "\033[1;36mРабота с архивами\033[0m"
  echo "*необходимо установить пакет patool (epm i patool)"
  printf "┌──────────────────────────────────────────┬────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                              │ \033[1;37mОписание\033[0m                                   │\n"
  printf "├──────────────────────────────────────────┼────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm tool erc \033[0m<folder>\033[0m                    │ Создать архив из папки                     │\n"
  printf "│ \033[1;33mepm tool erc a \033[0m<archive> <files>\033[0m         │ Добавить файлы в архив                     │\n"
  printf "│ \033[1;33mepm tool erc l \033[0m<archive>\033[0m                 │ Вывести список файлов внутри архива        │\n"
  printf "│ \033[1;33mepm tool erc repack \033[0m<archive> <format>:\033[0m  │ Перепаковать архив/ы в другой формат       │\n"
  printf "│ \033[1;33mepm tool erc repack \033[0m<archive> <archive2>\033[0m │ Перепаковать созданный в новый архив       │\n"
  printf "│ \033[1;33mepm tool erc x \033[0m<archive>\033[0m                 │ Распаковать архив в текущую директорию     │\n"
  printf "│ \033[1;33mepm tool erc formats\033[0m                     │ Поддерживаемые форматы архивов             │\n"
  printf "└──────────────────────────────────────────┴────────────────────────────────────────────┘\n"
  echo

  echo -e "\033[1;36mHTTP запросы\033[0m"
  echo "Инструмент для загрузки файлов с поддержкой подстановочных знаков (*) в именах файлов."
  echo 
  echo "Поддерживаемые URL-протоколы:"
  echo "ftp:// http:// https:// file:/ ipfs://"
  echo 
  echo "Поддерживаемые движки загрузки (можно задать через переменную EGET_BACKEND=curl):"
  echo "wget curl"

  printf "┌──────────────────────────────────────┬────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                          │ \033[1;37mОписание\033[0m                                       │\n"
  printf "├──────────────────────────────────────┼────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm tool eget \033[0m<url>      \033[0m            │ Скачать пакет по ссылке                        │\n"
  printf "│ \033[1;33mepm tool eget \033[0m<url/pkg*> \033[0m            │ Скачать все пакеты по шаблону pkg*             │\n"
  printf "│ \033[1;33mepm tool eget -P \033[0m<path> <url>  \033[0m      │ Скачать пакет в директорию                     │\n"
  printf "│ \033[1;33mepm tool eget --allow-mirrors \033[0m<url>\033[0m  │ Скачать через альтернативные зеркала           │\n"
  printf "│ \033[1;33mepm tool eget --check-url \033[0m<url>\033[0m      │ Проверить, существует ли пакет                 │\n"
  printf "│ \033[1;33mepm tool eget --check-site \033[0m<url>\033[0m     │ Проверить доступность сайта                    │\n"
  printf "│ \033[1;33mepm tool eget --get-response \033[0m<url>\033[0m   │ Вывести заголовки ответа сервера               │\n"
  printf "│ \033[1;33mepm tool eget --list \033[0m<url/pkg*>\033[0m      │ Вывести доступные версии пакета                │\n"
  printf "└──────────────────────────────────────┴────────────────────────────────────────────────┘\n"
  echo

  echo -e "\033[1;36mСодержимое файлов\033[0m"
  printf "┌──────────────────────────────────────┬────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                          │ \033[1;37mОписание\033[0m                                       │\n"
  printf "├──────────────────────────────────────┼────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm tool ercat\033[0m <file>\033[0m                │ Просмотреть содержимое файла                   │\n"
  printf "└──────────────────────────────────────┴────────────────────────────────────────────────┘\n"
  echo
}

package_help() {
  ##########################
  # Работа с пакетами
  ##########################
  echo -e "\033[1;36m[ Работа с пакетами ]\033[0m"
  printf "┌─────────────────────────────────┬─────────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                     │ \033[1;37mОписание\033[0m                                            │\n"
  printf "├─────────────────────────────────┼─────────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm i\033[0m <pkg>|<file>              │ Установка пакета из репозитория или файла           │\n"
  printf "│ \033[1;33mepm e\033[0m <pkg>                     │ Удаление пакета                                     │\n"
  printf "│ \033[1;33mepm s\033[0m <text>                    │ Поиск пакета в репозитории                          │\n"
  printf "│ \033[1;33mepm q\033[0m <pkg>                     │ Проверка, установлен ли пакет                       │\n"
  printf "│ \033[1;33mepm qa\033[0m                          │ Список всех установленных пакетов                   │\n"
  printf "│ \033[1;33mepm qp\033[0m <word>                   │ Поиск по названиям установленных пакетов            │\n"
  printf "│ \033[1;33mepm qf\033[0m <file>                   │ Какому пакету принадлежит файл                      │\n"
  printf "│ \033[1;33mepm sf\033[0m <file>                   │ В каком пакете содержится указанный файл            │\n"
  printf "│ \033[1;33mepm ql\033[0m <pkg>                    │ Список файлов в установленном пакете                │\n"
  printf "│ \033[1;33mepm qi\033[0m <pkg>                    │ Информация о пакете                                 │\n"
  printf "│ \033[1;33mepm cl\033[0m <pkg>                    │ Просмотр журнала изменений пакета                   │\n"
  printf "│ \033[1;33mepm req\033[0m <pkg>                   │ Просмотр зависимостей пакета                        │\n"
  printf "├─────────────────────────────────┼─────────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm simulate\033[0m                    │ Проверка зависимостей без установки (симуляция)     │\n"
  printf "│ \033[1;33mepm reinstall\033[0m <pkg>             │ Переустановка пакета                                │\n"
  printf "│ \033[1;33mepm Install\033[0m <pkg>               │ Обновление и установка пакета                       │\n"
  printf "│ \033[1;33mepm download\033[0m <pkg>              │ Скачивание файла пакета в текущую директорию        │\n"
  printf "│ \033[1;33mepm assure\033[0m <cmd> [pkg] [ver]    │ Установка пакета, если команда отсутствует          │\n"
  printf "│ \033[1;33mepm restore\033[0m                     │ Установка пакетов проекта                           │\n"
  printf "│ \033[1;33mepm checkpkg\033[0m <file>             │ Проверка целостности файла пакета                   │\n"
  printf "│ \033[1;33mepm audit\033[0m                       │ Аудит установленных пакетов на наличие уязвимостей  │\n"
  printf "│ \033[1;33mepm provides\033[0m <name>             │ Что предоставляет пакет                             │\n"
  printf "│ \033[1;33mepm whatdepends\033[0m <pkg>           │ Вывод зависимых пакетов зависят от указанного       │\n"
  printf "│ \033[1;33mepm whatprovides\033[0m <target>       │ Вывод пакетов обеспечивающих указанный              │\n"
  printf "│ \033[1;33mepm conflicts\033[0m <pkg>             │ Вывод конфликтов пакета                             │\n"
  printf "│ \033[1;33mepm list-available\033[0m              │ Список всех доступных пакетов                       │\n"
  printf "│ \033[1;33mepm programs\033[0m                    │ Список установленных GUI-программ                   │\n"
  printf "│ \033[1;33mepm policy\033[0m <pkg>                │ Приоритеты выбора пакета (политика установки)       │\n"
  printf "│ \033[1;33mepm pack\033[0m <src>                  │ Упаковка архива или директории в RPM-пакет          │\n"
  printf "│ \033[1;33mepm site\033[0m <pkg>                  │ Открытие сайта пакета в браузере                    │\n"
  printf "└─────────────────────────────────┴─────────────────────────────────────────────────────┘\n"
  echo
}

system_help() {
  ##########################
  # Работа с системой
  ##########################
  echo -e "\033[1;36m[ Работа с системой ]\033[0m"
  printf "┌─────────────────────────────────┬─────────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                     │ \033[1;37mОписание\033[0m                                            │\n"
  printf "├─────────────────────────────────┼─────────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm update\033[0m                      │ Обновить список доступных пакетов                   │\n"
  printf "│ \033[1;33mepm downgrade\033[0m                   │ Синхронизация с состоянием в репозитории (откат)    │\n"
  printf "│ \033[1;33mepm Upgrade\033[0m                     │ Форсированное обновление базы и системы             │\n"
  printf "│ \033[1;33mepm Downgrade\033[0m                   │ Форсированный откат до состояния из репозитория     │\n"
  printf "│ \033[1;33mepm kernel-upgrade\033[0m              │ Обновление ядра системы                             │\n"
  printf "│ \033[1;33mepm upgrade\033[0m                     │ Обновление дистрибутива (без ядра)                  │\n"
  printf "│ \033[1;33mepm full-upgrade\033[0m                │ Полное обновление системы (включая ядро)            │\n"
  printf "│ \033[1;33mepm release-upgrade\033[0m             │ Обновление системы до следующего релиза             │\n"
  printf "│ \033[1;33mepm release-downgrade\033[0m           │ Откат системы до предыдущего релиза                 │\n"
  printf "│ \033[1;33mepm check\033[0m                       │ Проверка и исправление локальной базы пакетов       │\n"
  printf "│ \033[1;33mepm ei\033[0m                          │ Установка пакета из Korinf                          │\n"
  printf "│ \033[1;33mepm clean\033[0m                       │ Очистка локального кэша пакетов                     │\n"
  printf "│ \033[1;33mepm autoremove\033[0m                  │ Удаление ненужных пакетов                           │\n"
  printf "│ \033[1;33mepm dedup\033[0m                       │ Удаление дубликатов пакетов (после ошибки upgrade)  │\n"
  printf "│ \033[1;33mepm autoorphans\033[0m                 │ Удаление всех пакетов, отсутствующих в репозиториях │\n"
  printf "│ \033[1;33mepm remove-old-kernels\033[0m          │ Удаление старых ядер (кроме текущего и 2 последних) │\n"
  printf "└─────────────────────────────────┴─────────────────────────────────────────────────────┘\n"
  echo
}

play_help() {
  ##########################
  # epm play (приложения)
  ##########################
  echo -e "\033[1;36m[ Работа с приложениями (epm play) ]\033[0m"
  printf "┌─────────────────────────────────┬─────────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                     │ \033[1;37mОписание\033[0m                                            │\n"
  printf "├─────────────────────────────────┼─────────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm play\033[0m                        │ Список доступных к установке приложений             │\n"
  printf "│ \033[1;33mepm play --list\033[0m                 │ Список установленных приложений                     │\n"
  printf "│ \033[1;33mepm play --list-scripts\033[0m         │ Список установленных утилит                         │\n"
  printf "│ \033[1;33mepm play\033[0m <pkg>                  │ Установка указанного приложения                     │\n"
  printf "│ \033[1;33mepm play --latest\033[0m <pkg>         │ Установка последней версии приложения               │\n"
  printf "│ \033[1;33mepm play --remove\033[0m <pkg>         │ Удаление указанного приложения                      │\n"
  printf "│ \033[1;33mepm play --update \033[0m<pkg>         │ Обновить приложение                                 │\n"
  printf "│ \033[1;33mepm play --update all\033[0m           │ Обновить все приложения                             │\n"
  printf "│ \033[1;33mepm play --installed\033[0m <pkg>      │ Проверка, установлено ли приложение                 │\n"
  printf "└─────────────────────────────────┴─────────────────────────────────────────────────────┘\n"
  echo

}

repack_help() {
  ##########################
  # epm repack
  ##########################
  echo -e "\033[1;36m[ Конвертирование пакетов в стандарт RPM семейства АЛЬТ (epm repack) ]\033[0m"
  echo -e "Поддерживаемые менеджеры: deb, rpm, tgz, tbz, tbz2, apk, pkg.gz, AppImage"
  printf "┌─────────────────────────────────┬─────────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                     │ \033[1;37mОписание\033[0m                                            │\n"
  printf "├─────────────────────────────────┼─────────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm repack\033[0m <pkg>                │ Перепаковка установленного пакета                   │\n"
  printf "└─────────────────────────────────┴─────────────────────────────────────────────────────┘\n"
  echo
}

mark_help() {
  ##################################
  # epm mark (маркировка пакетов)
  ##################################
  echo -e "\033[1;36m[ Управление метками пакетов (epm mark) ]\033[0m"
  printf "┌──────────────────────────────────┬────────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                      │ \033[1;37mОписание\033[0m                                           │\n"
  printf "├──────────────────────────────────┼────────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm mark hold\033[0m <pkg>              │ Пометить пакет как «удержанный» (не обновлять)     │\n"
  printf "│ \033[1;33mepm mark unhold\033[0m <pkg>            │ Снять блокировку обновления пакета                 │\n"
  printf "│ \033[1;33mepm mark showhold\033[0m                │ Показать все удержанные (заблокированные) пакеты   │\n"
  printf "│ \033[1;33mepm mark checkhold\033[0m <pkg>         │ Проверить, удерживается ли указанный пакет         │\n"
  printf "│ \033[1;33mepm mark manual\033[0m <pkg>            │ Пометить пакет как установленный вручную           │\n"
  printf "│ \033[1;33mepm mark auto\033[0m <pkg>              │ Пометить пакет как установленный автоматически     │\n"
  printf "│ \033[1;33mepm mark showmanual\033[0m              │ Показать вручную установленные пакеты              │\n"
  printf "│ \033[1;33mepm mark showauto\033[0m                │ Показать автоматически установленные пакеты        │\n"
  printf "└──────────────────────────────────┴────────────────────────────────────────────────────┘\n"
  echo
}

status_help() {
  ##################################
  # epm status (состояние пакетов)
  ##################################
  echo -e "\033[1;36m[ Проверка состояния пакетов (epm status) ]\033[0m"
  printf "┌────────────────────────────────────────┬──────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                            │ \033[1;37mОписание\033[0m                                     │\n"
  printf "├────────────────────────────────────────┼──────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm status --installed \033[0m[version] <pkg> │ Установлен ли пакет (не старше версии)       │\n"
  printf "│ \033[1;33mepm status --installable\033[0m <pkg>         │ Можно ли установить пакет из репозитория     │\n"
  printf "│ \033[1;33mepm status --original\033[0m <pkg>            │ Принадлежит ли пакет оф.репозиторию          │\n"
  printf "│ \033[1;33mepm status --certified\033[0m <pkg>           │ Сертифицирован ли пакет для установки        │\n"
  printf "│ \033[1;33mepm status --thirdparty\033[0m <pkg>          │ Является ли пакет сторонним                  │\n"
  printf "│ \033[1;33mepm status --repacked\033[0m <pkg>            │ Была ли сделана перепаковка пакета           │\n"
  printf "│ \033[1;33mepm status --validate\033[0m <pkg>            │ Доступен ли пакет и его метаданные           │\n"
  printf "│ \033[1;33mepm status --supported\033[0m                 │ Поддерживает ли дистрибутив команду status   │\n"
  printf "└────────────────────────────────────────┴──────────────────────────────────────────────┘\n"
  echo
}

list_help() {
  ##################################
  # epm list (список пакетов)
  ##################################
  echo -e "\033[1;36m[ Просмотр пакетов (epm list) ]\033[0m"
  printf "┌──────────────────────────────────┬────────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                      │ \033[1;37mОписание\033[0m                                           │\n"
  printf "├──────────────────────────────────┼────────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm list\033[0m                         │ Показать все пакеты (установл. и доступные)        │\n"
  printf "│ \033[1;33mepm list --available\033[0m             │ Показать только доступные к установке              │\n"
  printf "│ \033[1;33mepm list --installed\033[0m             │ Показать установленные в системе пакеты            │\n"
  printf "│ \033[1;33mepm list --upgradable\033[0m            │ Показать пакеты с доступными обновлениями          │\n"
  printf "└──────────────────────────────────┴────────────────────────────────────────────────────┘\n"
  echo
}

repo_help() {
  ##################################
  # epm repo (работа с репозиториями)
  ##################################
  echo -e "\033[1;36m[ Управление источниками пакетов (epm repo) ]\033[0m"
  printf "┌────────────────────────────────────┬──────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                        │ \033[1;37mОписание\033[0m                                         │\n"
  printf "├────────────────────────────────────┼──────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm repo list\033[0m                      │ Список включённых репозиториев                   │\n"
  printf "│ \033[1;33mepm repo list -a\033[0m                   │ Показать все (включая отключённые) репозитории   │\n"
  printf "│ \033[1;33mepm repo change\033[0m <mirror>           │ Переключение источников на указанный зеркальный  │\n"
  printf "│ \033[1;33mepm repo set\033[0m <repo>                │ Очистить и установить стандартный источник       │\n"
  printf "│ \033[1;33mepm repo switch\033[0m <repo>             │ Переключить на другой репозиторий                │\n"
  printf "│ \033[1;33mepm repo enable\033[0m <repo>             │ Включить указанный репозиторий                   │\n"
  printf "│ \033[1;33mepm repo disable\033[0m <repo>            │ Отключить указанный репозиторий                  │\n"
  printf "│ \033[1;33mepm repo add\033[0m                       │ Добавить репозиторий (из списка доступных)       │\n"
  printf "│ \033[1;33mepm repo Add\033[0m                       │ Добавить и сразу обновить источники              │\n"
  printf "│ \033[1;33mepm repo rm <repo>\033[0m                 │ Удалить репозиторий из списка                    │\n"
  printf "│ \033[1;33mepm repo fix\033[0m                       │ Исправить пути в списках источников (ALT Linux)  │\n"
  printf "│ \033[1;33mepm repo clean\033[0m                     │ Удалить временные источники (задачи, CD-ROM)     │\n"
  printf "│ \033[1;33mepm repo save\033[0m                      │ Сохранить текущие списки источников              │\n"
  printf "│ \033[1;33mepm repo restore\033[0m                   │ Восстановить сохранённые списки                  │\n"
  printf "│ \033[1;33mepm repo reset\033[0m                     │ Сбросить списки до настроек по умолчанию         │\n"
  printf "│ \033[1;33mepm repo status\033[0m                    │ Показать состояние текущих источников            │\n"
  printf "│ \033[1;33mepm repo addkey\033[0m <url|file>         │ Добавить GPG-ключ репозитория                    │\n"
  printf "│ \033[1;33mepm repo importgpg\033[0m <url|file>      │ Импортировать GPG-ключ                           │\n"
  printf "├────────────────────────────────────┼──────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm repo create\033[0m [path] [name]      │ Инициализировать локальный репозиторий           │\n"
  printf "│ \033[1;33mepm repo index\033[0m  [--init] [path]    │ Обновить индексы локального репозитория          │\n"
  printf "│ \033[1;33mepm repo pkgadd\033[0m <dir> <pkg(s)>     │ Добавить пакеты в локальный репозиторий          │\n"
  printf "│ \033[1;33mepm repo pkgupdate\033[0m <dir> <pkg(s)>  │ Заменить пакеты в локальном репозитории новыми   │\n"
  printf "│ \033[1;33mepm repo pkgdel\033[0m <dir> <pkg(s)>     │ Удалить пакеты из локального репозитория         │\n"
  printf "└────────────────────────────────────┴──────────────────────────────────────────────────┘\n"
  echo
}

print_help() {
  ##################################
  # epm print (печать информации)
  ##################################
  echo -e "\033[1;36m[ Вывод информации (epm print) ]\033[0m"
  echo "Команды для получения сведений о пакетах, файлах и системе"
  printf "┌──────────────────────────────────────┬────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                          │ \033[1;37mОписание\033[0m                                       │\n"
  printf "├──────────────────────────────────────┼────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm print info\033[0m                       │ Информация о системе и дистрибутиве            │\n"
  printf "│ \033[1;33mepm print name\033[0m <file|pkg>            │ Имя пакета или файла                           │\n"
  printf "│ \033[1;33mepm print shortname\033[0m <pkg>            │ Короткое имя пакета или файла                  │\n"
  printf "│ \033[1;33mepm print version\033[0m <file|pkg>         │ Версия пакета или файла                        │\n"
  printf "│ \033[1;33mepm print release\033[0m <file|pkg>         │ Релиз пакета или файла                         │\n"
  printf "│ \033[1;33mepm print version-release\033[0m <file|pkg> │ Версия релиза пакета или файла                 │\n"
  printf "│ \033[1;33mepm print arch\033[0m <file|pkg>            │ Архитектура пакета или файла                   │\n"
  printf "│ \033[1;33mepm print field\033[0m <field> <pkg>        │ Значение указанного поля пакета                │\n"
  printf "│ \033[1;33mepm print pkgname\033[0m <file>             │ Имя пакета из файла                            │\n"
  printf "│ \033[1;33mepm print srcname\033[0m <file>             │ Имя источника пакета                           │\n"
  printf "│ \033[1;33mepm print srcpkgname\033[0m <file|pkg>      │ Имя исходного пакета бинарного файла пакета    │\n"
  printf "│ \033[1;33mepm print specname\033[0m <file>            │ Имя spec-файла для исходного пакета            │\n"
  printf "│ \033[1;33mepm print binpkgfilelist\033[0m <dir> <pkg> │ Файлы бинарных пакетов из каталога             │\n"
  printf "│ \033[1;33mepm print compare\033[0m <ver1> <ver2>      │ Сравнение версий пакета (вернёт -1, 0 или 1)   │\n"
  printf "│ \033[1;33mepm print enough\033[0m <pkg> <version>     │ Достаточность установленной версии             │\n"
  printf "│ \033[1;33mepm print constructname\033[0m [args]       │ Вывод имени файла пакета от аргументов         │\n"
  printf "└──────────────────────────────────────┴────────────────────────────────────────────────┘\n"
  echo
}

history_help() {
  ##################################
  # epm history (журнал операций)
  ##################################
  echo -e "\033[1;36m[ История управления пакетами (epm history) ]\033[0m"
  printf "┌────────────────────────────────────┬──────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                        │ \033[1;37mОписание\033[0m                                         │\n"
  printf "├────────────────────────────────────┼──────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm history\033[0m                        │ Показать полную историю действий                 │\n"
  printf "│ \033[1;33mepm history --installed\033[0m            │ Только установки новых пакетов                   │\n"
  printf "│ \033[1;33mepm history --removed\033[0m              │ Только удалённые пакеты                          │\n"
  printf "│ \033[1;33mepm history --updated\033[0m              │ Только обновления пакетов                        │\n"
  printf "└────────────────────────────────────┴──────────────────────────────────────────────────┘\n"
  echo
}

prescription_help() {
    ##################################
  # epm prescription (рецепты)
  ##################################
  echo -e "\033[1;36m[ Работа с рецептами (epm prescription) ]\033[0m"
  echo "Инструмент с готовыми рецептами для автоматизации задач"
  printf "┌────────────────────────────────────┬──────────────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда epm\033[0m                        │ \033[1;37mОписание\033[0m                                         │\n"
  printf "├────────────────────────────────────┼──────────────────────────────────────────────────┤\n"
  printf "│ \033[1;33mepm prescription\033[0m                   │ Показать все доступные рецепты                   │\n"
  printf "│ \033[1;33mepm prescription \033[0m<recipe>          │ Запустить рецепт по названию                     │\n"
  printf "└────────────────────────────────────┴──────────────────────────────────────────────────┘\n"
  echo
}

about_help() {
  echo -e "\033[1;33mИспользование eepm-help:\033[0m"
  printf "┌─────────────────────────┬───────────────────────────────────────────┐\n"
  printf "│ \033[1;33mКоманда\033[0m                 │ \033[1;37mОписание\033[0m                                  │\n"
  printf "├─────────────────────────┼───────────────────────────────────────────┤\n"
  printf "│ \033[1;33meepm-help -full\033[0m         │ Вывод полной справки по всем командам epm │\n"
  printf "│ \033[1;33meepm-help -pkg\033[0m          │ Управление пакетами                       │\n"
  printf "│ \033[1;33meepm-help -sys\033[0m          │ Управление системой                       │\n"
  printf "│ \033[1;33meepm-help -play\033[0m         │ Установка приложений (epm play)           │\n"
  printf "│ \033[1;33meepm-help -repack\033[0m       │ Конвертирование пакетов                   │\n"
  printf "│ \033[1;33meepm-help -tool\033[0m         │ Дополнительные инструменты epm            │\n"
  printf "│ \033[1;33meepm-help -mark\033[0m         │ Управление метками пакетов                │\n"
  printf "│ \033[1;33meepm-help -status\033[0m       │ Проверка состояния пакетов                │\n"
  printf "│ \033[1;33meepm-help -list\033[0m         │ Просмотр пакетов                          │\n"
  printf "│ \033[1;33meepm-help -repo\033[0m         │ Управление репозиториями                  │\n"
  printf "│ \033[1;33meepm-help -history\033[0m      │ История операций                          │\n"
  printf "│ \033[1;33meepm-help -prescription\033[0m │ Работа с рецептами                        │\n"
  printf "│ \033[1;33meepm-help -print\033[0m        │ Вывод информации                          │\n"
  printf "└─────────────────────────┴───────────────────────────────────────────┘\n"
  echo
}

case "$1" in
    -full|--full|full)
        title
        package_help
        system_help
        play_help
        repack_help
        tool_help
        mark_help
        status_help
        list_help
        repo_help
        history_help
        prescription_help
        print_help
        ;;
    -package|--package|package|--pkg|-pkg|pkg)
        title
        package_help
        ;;
    -sys|--sys|sys|-system|--system|system)
        title
        system_help
        ;;
    -play|--play|play)
        title
        play_help
        ;;
    -repack|--repack|repack)
        title
        repack_help
        ;;
    -tool|--tool|tool)
        title
        tool_help
        ;;
    -mark|--mark|mark)
        title
        mark_help
        ;;
    -status|--status|status)
        title
        status_help
        ;;
    -list|--list|list)
        title
        list_help
        ;;
    -repo|--repo|repo)
        title
        repo_help
        ;;
    -history|--history|history)
        title
        history_help
        ;;
    -prescription|--prescription|prescription|--recipe|-recipe|recipe)
        title
        prescription_help
        ;;
    -print|--print|print)
        title
        print_help
        ;;
    *)
      title
      about_help
        ;;
esac